import random

filepath = 'name.txt'
f = open(filepath,'w')

last_names = ['김', '이', '박', '나', '권', '임', '최', '추','라','정','하','남']

# 보편적인 한국인 이름 리스트
first_names = [
    '민준', '서연', '민서', '서준', '지민', '하은', '지후', '윤서', '윤아', '예준',
    '준서', '지훈', '지원', '수아', '지우', '지유', '준혁', '서현', '다은', '지아',
    '시우', '서윤', '하율', '지호', '시윤', '은서', '은우', '수민', '지안', '수현',
    '민재', '하린', '서진', '유준', '지애', '수혁', '예은', '시현', '주원', '하윤',
    '예린', '도윤', '예지', '시후', '주희', '은영', '준우', '하람', '승우', '예나',
    '승민', '지한', '서율', '수지', '민혁', '세은', '유진', '주현', '은채', '동현',
    '은우', '유나', '승현', '지우', '은지', '태윤', '민지', '재원', '재은', '태민',
    '주영', '소민', '유빈', '민경', '태현', '은재', '세진', '준우', '현준', '지윤',
    '다인', '태희', '승아', '현우', '민성', '성민', '태훈', '민규', '시원', '예인',
    '민지', '진우', '태성', '재현', '재윤', '도현', '세희', '하연', '수빈', '민균'
]

def generate_korean_name():
    first_name = random.choice(first_names)
    last_name = random.choice(last_names)
    return last_name + first_name

ex_names = []
# 100개의 이름 생성
for i in range(300):
    name = generate_korean_name()
    ex_names.append(name)

i=1
for name in ex_names:
    f.write(f'{i} : {name} \n')
    i=i+1

f.close